controllers/StdtController.php

SELECT * FROM `class_t` ORDER BY `id` DESC
---
    public function actionIndex()
    {
        $searchModel = new StdtSearch();
		$dataProvider = $searchModel -> searchbysql( Yii::$app->request->queryParams );

		$cache = Yii::$app->cache;
		$c_list = $cache->get( 'cache_classt' );

		if ( $c_list === false ) {

			//搜索参数
			$c_list = Classt::find() -> orderBy('id DESC')->all(); //获取 “班级” 数据